//==============================================================================
// Название:        Диалоговое окно "О программе"
// Авторские права: ООО "ДВГ" DeveloperGroup (г. Санкт-Петербург)
//==============================================================================
//
// Автор:     $Author: Vladimir Zhandarov $
// Создан:    2014.09.26
// Изменен:   $Date:$
// Модуль:    iceapp
// Платформа: Intel Windows 7 Professional SP1
//
//------------------------------------------------------------------------------
// Имя файла: aboutdialog.h
//------------------------------------------------------------------------------
// Примечание: 
//------------------------------------------------------------------------------
// Внимание:
//------------------------------------------------------------------------------

#ifndef ABOUTDIALOG_H
#define ABOUTDIALOG_H

#include <QtGui/QDialog>

#include "ui_aboutdialog.h"

/**
* @class AboutDialog
* Диалоговое окно "О программе"
*/
class AboutDialog : public QDialog
{
	Q_OBJECT
public:
	/**
	* Конструктор
	* @param parent родительский объект
	* @param f флаги окна
	*/
	AboutDialog(QWidget* parent = 0, Qt::WindowFlags f = 0);

	/**
	* Деструктор
	*/
	~AboutDialog();

	/**
	* Установить номер версии программы
	* @param version номер версии программы
	*/
	void setVersion(const QString& version);

private:
	Ui::AboutDialog ui;	///< Ui класс
};

#endif // ABOUTDIALOG_H
