//==============================================================================
// Название:        Приложение
// Авторские права: ООО "ДВГ" DeveloperGroup (г. Санкт-Петербург)
//==============================================================================
//
// Автор:     $Author: Vladimir Zhandarov $
// Создан:    2011.11.08
// Изменен:   $Date:$
// Модуль:    iceapp
// Платформа: Intel Windows 7 Professional SP1
//
//------------------------------------------------------------------------------
// Имя файла: iceapp.h
//------------------------------------------------------------------------------
// Примечание: 
//------------------------------------------------------------------------------
// Внимание:
//------------------------------------------------------------------------------

#ifndef ICEAPP_H
#define ICEAPP_H

#include <QtGui/QApplication>

class IceApp: public QApplication
{
	Q_OBJECT
public:
	IceApp(int& argc, char** argv);
	~IceApp();
};

#endif // ICEAPP_H
