#==============================================================================
# Название:        Общие данные для скриптов сборки дистрибутивов ПК КОЛОс
# Авторские права: ООО "ДВГ" DeveloperGroup (г. Санкт-Петербург)
#==============================================================================
#
# Автор:     $Author: shchav $
# Создан:    2011.11.08
# Изменен:   $Date: 2012-03-06 15:06:30 +0300 (Р’С‚, 06 РјР°СЂ 2012) $
# Платформа: Intel Windows 7 Professional SP1 x64
#
#------------------------------------------------------------------------------
# Примечание:
#------------------------------------------------------------------------------
# Внимание:
#-----------------------------------------------------------------------------


#------------------------------------------------------------------------------
# Константы
#------------------------------------------------------------------------------
# Наименование организации
!define _COMPANY_NAME_ "ДВГ"
!define _COMPANY_NAME_FS_ "DVG"
# Почтовый адрес организации
!define _COMPANY_E_MAIL_ "support@dvg.spb.ru"
# Наименование системы
!define _SYSTEM_NAME_ "ПК $\"ТУНДРА$\""
!define _SYSTEM_NAME_FS_ "TUNDRA"
# Версия системы (берется из переменной окружения, установленной внешним скриптом)
!define _SOFT_VERSION_ $%VERSION%

# Наименование ОС Windows
!define _WINDOWS_NAME_ "7"
# Тип ОС Windows
!define _WINDOWS_TYPE_ "Professional"
# Пакет обновления ОС Windows
!define _WINDOWS_SERVICE_PACK_ "Service Pack 1"
# Разрядность ОС Windows
!define _WINDOWS_PLATFORM_ARCHITECTURE_ "64"


#------------------------------------------------------------------------------
# Подключение вспомогательных библиотек
#------------------------------------------------------------------------------
!include "fncsprt.nsh"
